In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[np.nan,np.nan,np.nan]],columns=['A','B','C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [4]:
df.aggregate(['sum'])

        A     B     C
sum  12.0  15.0  18.0

In [5]:
df.agg(['sum'])

        A     B     C
sum  12.0  15.0  18.0

In [6]:
df.agg(['sum','min','max'])

        A     B     C
sum  12.0  15.0  18.0
min   1.0   2.0   3.0
max   7.0   8.0   9.0

In [17]:
e=df.agg({'A':['sum','min'],'B':['min','max']})
print(e)

        A    B
sum  12.0  NaN
min   1.0  2.0
max   NaN  8.0

In [18]:
k=df.agg(['sum'],axis='columns')
k

    sum
0   6.0
1  15.0
2  24.0
3   0.0

In [10]:
df.agg(['sum'],axis='rows')

        A     B     C
sum  12.0  15.0  18.0

In [11]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [16]:
g=df.agg(x=('A','max'),y=('B','min'),z=('C',np.mean))
print(g)

     A    B    C
x  7.0  NaN  NaN
y  NaN  2.0  NaN
z  NaN  NaN  6.0